## DataFrame

In [6]:
student_1 = data.frame('name' = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark'),
                       'age' = c(17, 16, 12, 18, 19),
                       'mark' = c(8, 7, 9, 8, 9),
                       stringsAsFactors = FALSE)
student_1

  name   age mark
1 Hellen 17  8
2 Jolie  16  7
3 Kiwi   12  9
4 John   18  8
5 Mark   19  9

In [7]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark')
age = c(17, 16, 12, 18, 19)
mark = c(8, 7, 9, 8, 9)
student_2 = data.frame(name, age, mark, stringsAsFactors = FALSE)
student_2

  name   age mark
1 Hellen 17  8
2 Jolie  16  7
3 Kiwi   12  9
4 John   18  8
5 Mark   19  9

In [8]:
str(student_2)

'data.frame':	5 obs. of  3 variables:
 $ name: chr  "Hellen" "Jolie" "Kiwi" "John" ...
 $ age : num  17 16 12 18 19
 $ mark: num  8 7 9 8 9

In [9]:
summary(student_2)

     name                age            mark
 Length:5           Min.   :12.0   Min.   :7.0
 Class :character   1st Qu.:16.0   1st Qu.:8.0
 Mode  :character   Median :17.0   Median :8.0
                    Mean   :16.4   Mean   :8.2
                    3rd Qu.:18.0   3rd Qu.:9.0
                    Max.   :19.0   Max.   :9.0

In [10]:
student_2$mark

[1] 8 7 9 8 9

In [11]:
data.frame(student_2$age)

  student_2.age
1 17
2 16
3 12
4 18
5 19

In [12]:
student_2$class = c('k234', 'k232', 'k256', 'k212', 'k232')
student_2

  name   age mark class
1 Hellen 17  8    k234
2 Jolie  16  7    k232
3 Kiwi   12  9    k256
4 John   18  8    k212
5 Mark   19  9    k232

In [13]:
pob = data.frame('pob' = c('UK', 'US', 'VN', 'EU', 'US'))
students = cbind(student_2, pob)
students

  name   age mark class pob
1 Hellen 17  8    k234  UK
2 Jolie  16  7    k232  US
3 Kiwi   12  9    k256  VN
4 John   18  8    k212  EU
5 Mark   19  9    k232  US

In [14]:
new_students = data.frame('name' = 'Sunny', 'age' = 17, 'mark' = 8, 'class' = 'k256', 'pob' = 'EU')

In [16]:
students = rbind(students, new_students)
students

  name   age mark class pob
1 Hellen 17  8    k234  UK
2 Jolie  16  7    k232  US
3 Kiwi   12  9    k256  VN
4 John   18  8    k212  EU
5 Mark   19  9    k232  US
6 Sunny  17  8    k256  EU

In [18]:
names(students)[names(students) == 'pob'] = 'Place of Birth'
head(students)

  name   age mark class Place of Birth
1 Hellen 17  8    k234  UK
2 Jolie  16  7    k232  US
3 Kiwi   12  9    k256  VN
4 John   18  8    k212  EU
5 Mark   19  9    k232  US
6 Sunny  17  8    k256  EU

## Tidyverse

In [19]:
install.packages('tidyverse')

also installing the dependencies ‘colorspace’, ‘sys’, ‘ps’, ‘rappdirs’, ‘rematch’, ‘farver’, ‘labeling’, ‘munsell’, ‘RColorBrewer’, ‘viridisLite’, ‘askpass’, ‘prettyunits’, ‘processx’, ‘highr’, ‘markdown’, ‘yaml’, ‘xfun’, ‘tinytex’, ‘backports’, ‘generics’, ‘assertthat’, ‘blob’, ‘DBI’, ‘R6’, ‘tidyselect’, ‘withr’, ‘data.table’, ‘cli’, ‘gargle’, ‘cellranger’, ‘curl’, ‘ids’, ‘rematch2’, ‘gtable’, ‘isoband’, ‘scales’, ‘cpp11’, ‘pkgconfig’, ‘mime’, ‘openssl’, ‘Rcpp’, ‘clipr’, ‘BH’, ‘progress’, ‘callr’, ‘fs’, ‘knitr’, ‘rmarkdown’, ‘selectr’, ‘stringi’, ‘broom’, ‘dbplyr’, ‘dplyr’, ‘dtplyr’, ‘forcats’, ‘googledrive’, ‘googlesheets4’, ‘ggplot2’, ‘haven’, ‘hms’, ‘httr’, ‘lubridate’, ‘magrittr’, ‘modelr’, ‘purrr’, ‘readr’, ‘readxl’, ‘reprex’, ‘rstudioapi’, ‘rvest’, ‘stringr’, ‘tibble’, ‘tidyr’, ‘xml2’

  There are binary versions available but the source versions are later:
            binary source needs_compilation
Rcpp         1.0.6  1.0.7              TRUE
googledrive  1.0.1  2.0.0             FALSE


The downloaded binary packages are in
	/var/folders/09/wkf60t9d5p749571dbkjv86h0000gn/T//RtmpuObSDe/downloaded_packages

installing the source packages ‘Rcpp’, ‘googledrive’

In [21]:
library(tidyverse)

In [22]:
pokemon = read.csv('pokemon.csv')
head(pokemon)

  X. Name                  Type.1 Type.2 Total HP Attack Defense Sp..Atk
1 1  Bulbasaur             Grass  Poison 318   45  49     49      65
2 2  Ivysaur               Grass  Poison 405   60  62     63      80
3 3  Venusaur              Grass  Poison 525   80  82     83     100
4 3  VenusaurMega Venusaur Grass  Poison 625   80 100    123     122
5 4  Charmander            Fire          309   39  52     43      60
6 5  Charmeleon            Fire          405   58  64     58      80
  Sp..Def Speed Generation Legendary
1  65     45    1          False
2  80     60    1          False
3 100     80    1          False
4 120     80    1          False
5  50     65    1          False
6  65     80    1          False

In [23]:
str(pokemon)

'data.frame':	800 obs. of  13 variables:
 $ X.        : int  1 2 3 3 4 5 6 6 6 7 ...
 $ Name      : chr  "Bulbasaur" "Ivysaur" "Venusaur" "VenusaurMega Venusaur" ...
 $ Type.1    : chr  "Grass" "Grass" "Grass" "Grass" ...
 $ Type.2    : chr  "Poison" "Poison" "Poison" "Poison" ...
 $ Total     : int  318 405 525 625 309 405 534 634 634 314 ...
 $ HP        : int  45 60 80 80 39 58 78 78 78 44 ...
 $ Attack    : int  49 62 82 100 52 64 84 130 104 48 ...
 $ Defense   : int  49 63 83 123 43 58 78 111 78 65 ...
 $ Sp..Atk   : int  65 80 100 122 60 80 109 130 159 50 ...
 $ Sp..Def   : int  65 80 100 120 50 65 85 85 115 64 ...
 $ Speed     : int  45 60 80 80 65 80 100 100 100 43 ...
 $ Generation: int  1 1 1 1 1 1 1 1 1 1 ...
 $ Legendary : chr  "False" "False" "False" "False" ...

In [25]:
pokemon_sub = select(pokemon, c(2, 5, 7, 8))
head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

In [27]:
pokemon_sub2 = pokemon %>% select(c(2, 5, 7, 8))
head(pokemon_sub2)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

In [31]:
head(select(pokemon, c(Name, Total, Attack)))

  Name                  Total Attack
1 Bulbasaur             318    49
2 Ivysaur               405    62
3 Venusaur              525    82
4 VenusaurMega Venusaur 625   100
5 Charmander            309    52
6 Charmeleon            405    64

In [33]:
head(select_if(pokemon, is.numeric))

  X. Total HP Attack Defense Sp..Atk Sp..Def Speed Generation
1 1  318   45  49     49      65      65     45    1
2 2  405   60  62     63      80      80     60    1
3 3  525   80  82     83     100     100     80    1
4 3  625   80 100    123     122     120     80    1
5 4  309   39  52     43      60      50     65    1
6 5  405   58  64     58      80      65     80    1

In [35]:
head(filter(pokemon_sub, Total >= 500, Total <=600))

  Name                Total Attack Defense
1 Venusaur            525    82     83
2 Charizard           534    84     78
3 Blastoise           530    83    100
4 PidgeotMega Pidgeot 579    80     80
5 Nidoqueen           505    92     87
6 Nidoking            505   102     77

In [38]:
pokemon_sub = mutate(pokemon_sub, Compare = ifelse(Attack > Defense, 1, 0))
head(pokemon_sub)

  Name                  Total Attack Defense Compare
1 Bulbasaur             318    49     49     0
2 Ivysaur               405    62     63     0
3 Venusaur              525    82     83     0
4 VenusaurMega Venusaur 625   100    123     0
5 Charmander            309    52     43     1
6 Charmeleon            405    64     58     1

In [39]:
head(arrange(pokemon_sub, Total))

  Name      Total Attack Defense Compare
1 Sunkern   180   30     30      0
2 Azurill   190   20     40      0
3 Kricketot 194   25     41      0
4 Caterpie  195   30     35      0
5 Weedle    195   35     30      1
6 Wurmple   195   45     35      1

In [40]:
head(arrange(pokemon_sub, desc(Total)))

  Name                  Total Attack Defense Compare
1 MewtwoMega Mewtwo X   780   190    100     1
2 MewtwoMega Mewtwo Y   780   150     70     1
3 RayquazaMega Rayquaza 780   180    100     1
4 KyogrePrimal Kyogre   770   150     90     1
5 GroudonPrimal Groudon 770   180    160     1
6 Arceus                720   120    120     0

In [41]:
group = group_by(pokemon, Type.1)
summary_type1 = summarize(group,
                         count = n(),
                         mean.Attack = mean(Attack, na.rm = T),
                         median.Attack = median(Attack, na.rm = T),
                         mean.Defense = mean(Defense, na.rm = T),
                         median.Defense = median(Defense, na.rm = T),
                         )

In [44]:
arrange(summary_type1, desc(mean.Attack))

   Type.1   count mean.Attack median.Attack mean.Defense median.Defense
1  Dragon    32   112.12500   113.5          86.37500     90.0
2  Fighting  27    96.77778   100.0          65.92593     70.0
3  Ground    32    95.75000    85.0          84.84375     84.5
4  Rock      44    92.86364    95.0         100.79545    100.0
5  Steel     27    92.70370    89.0         126.37037    120.0
6  Dark      31    88.38710    88.0          70.22581     70.0
7  Fire      52    84.76923    84.5          67.76923     64.0
8  Flying     4    78.75000    85.0          66.25000     75.0
9  Poison    28    74.67857    74.0          68.82143     67.0
10 Water    112    74.15179    72.0          72.94643     70.0
11 Ghost     32    73.78125    66.0          81.18750     72.5
12 Normal    98    73.46939    70.5          59.84694     60.0
13 Grass     70    73.21429    70.0          70.80000     66.0
14 Ice       24    72.75000    67.0          71.41667     75.0
15 Psychic   57    71.45614    57.0          67.68421     65.0
16 Bug       69    70.97101    65.0          70.72464     60.0
17 Electric  44    69.09091    65.0          66.29545     65.0
18 Fairy     17    61.52941    52.0          65.70588     66.0

In [46]:
head(count(pokemon, Type.1))

  Type.1   n
1 Bug      69
2 Dark     31
3 Dragon   32
4 Electric 44
5 Fairy    17
6 Fighting 27

In [52]:
sample_n(pokemon, 10)

   X.  Name                   Type.1   Type.2   Total HP  Attack Defense
1   37 Vulpix                 Fire              299    38  41    40
2  358 Chimecho               Psychic           425    65  50    70
3  325 Spoink                 Psychic           330    60  25    35
4    4 Charmander             Fire              309    39  52    43
5  158 Totodile               Water             314    50  65    64
6  115 Kangaskhan             Normal            490   105  95    80
7  647 KeldeoResolute Forme   Water    Fighting 580    91  72    90
8  108 Lickitung              Normal            385    90  55    75
9  642 ThundurusTherian Forme Electric Flying   580    79 105    70
10 603 Eelektrik              Electric          405    65  85    70
   Sp..Atk Sp..Def Speed Generation Legendary
1   50     65       65   1          False
2   95     80       65   3          False
3   70     80       60   3          False
4   60     50       65   1          False
5   44     48       43   2          False
6   40     80       90   1          False
7  129     90      108   5          False
8   60     75       30   1          False
9  145     80      101   5          True
10  75     70       40   5          False

In [57]:
sample_frac(pokemon, 0.005)

  X.  Name                  Type.1 Type.2 Total HP Attack Defense Sp..Atk
1  17 Pidgeotto             Normal Flying 349   63 60      55      50
2 711 GourgeistAverage Size Ghost  Grass  494   65 90     122      58
3 573 Cinccino              Normal        470   75 95      60      65
4 658 Greninja              Water  Dark   530   72 95      67     103
  Sp..Def Speed Generation Legendary
1 50       71   1          False
2 75       84   6          False
3 60      115   5          False
4 71      122   6          False

In [58]:
dim(sample_frac(pokemon, 0.005))

[1]  4 13

In [59]:
dim(pokemon)

[1] 800  13